mianos/esp32foc/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32"

CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8000

# Velocity slew = 100 rad/s^2: gentle open-loop ramp for the pump (avoids
# rotor pull-out under centrifugal load). Tune up if spin-up is too slow.
CONFIG_MOTOR_SLEW_RAD_S2_X10=1000

# Keep the carrier-peak ISR (Motor::on_pwm_peak) and the compare-write it calls
# alive during flash-cache-off windows (NVS writes, OTA). Without CACHE_SAFE the
# MCPWM interrupt is masked while the cache is disabled; without CTRL_FUNC_IN_IRAM
# mcpwm_comparator_set_compare_value lives in flash and would fault. Together they
# let the ISR keep commutating regardless of WiFi/web/flash activity.
CONFIG_MCPWM_ISR_CACHE_SAFE=y
CONFIG_MCPWM_CTRL_FUNC_IN_IRAM=y

CONFIG_MQTT_PROTOCOL_5=y
CONFIG_MQTT_TRANSPORT_SSL=y

CONFIG_LOG_DEFAULT_LEVEL_INFO=y

CONFIG_COMPILER_OPTIMIZATION_PERF=y

# OTA rollback: a new image boots into PENDING_VERIFY. main.cpp calls
# esp_ota_mark_app_valid_cancel_rollback() after the web server starts; if
# we never get that far (panic, wifi failure, etc.) the bootloader reverts
# to the previous slot on the next reboot.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
